{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Markdown语法","text":"Markdown是一种纯文本格式的标记语言。它通过简单的标记语法，可以使普通文本内容具有媲美Word的格式外观。目前该语法已经在简书、CSDN博客、印象笔记等平台上得到广泛运用，包括本站的所有文本内容，也是使用Markdown语法编撰的。 注意：标记与内容之间要留一个空格 一、标题1.语法： 123456# 这是一级标题## 这是二级标题### 这是三级标题#### 这是四级标题##### 这是五级标题###### 这是六级标题 2.示例： 这是一级标题这是二级标题这是三级标题这是四级标题这是五级标题这是六级标题 二、字体1.语法： 1234**这是加粗的文字***这是倾斜的文字****这是斜体加粗的文字***~~这是加删除线的文字~~ 2.示例： 这是加粗的文字这是倾斜的文字这是斜体加粗的文字这是加删除线的文字 三、引用1.语法： 123>这是引用的内容>>这是引用的内容>>>这是引用的内容 2.示例： 这是引用的内容 这是引用的内容 这是引用的内容 四、分割线1.语法： 12345-------********注：- 和 * 超过三个就可以 2.示例： 五、图片1.语法： 123![图片名称](图片路径 )![图片名称](图片路径 \"alt信息\")注：alt信息可加可不加 2.示例： 六、超链接1.语法： 123[超链接名](超链接地址 )[超链接名](超链接地址 \"title信息\")注：title信息可加可不加 2.示例：简书百度 七、无序列表：1.语法： 1234- 列表内容+ 列表内容* 列表内容注：无序列表用 - + * 任何一种都可以，- + * 跟内容之间都要有一个空格 2.示例： 列表内容 列表内容 列表内容 八、有序列表1.语法： 12341.列表内容2.列表内容3.列表内容注：数字加点，序号跟内容之间要有空格 2.示例： 1.列表内容2.列表内容3.列表内容 九、嵌套列表1.语法： 上一级和下一级之间敲三个空格即可 123456789- 列表内容 - 列表内容 + 列表内容 * 列表内容1 列表内容 1 列表内容 2 列表内容 3 列表内容 2.示例： 列表内容 列表内容 列表内容 列表内容 列表内容 列表内容 列表内容 列表内容 十、表格1.语法： 123456789101112| 表头 | 表头 || ---- | ---- || 单元格 | 单元格 || 单元格 | 单元格 || 左对齐 | 右对齐 | 居中对齐 || :-----| ----: | :----: || 单元格 | 单元格 | 单元格 || 单元格 | 单元格 | 单元格 |注1、 | 用来分隔不同单元格；- 用来分隔表头和其他行，一个就好，多用是为了对齐。2注、 -默认居左对齐 -:设置居右对齐 :-:设置居中对齐。 2.示例： 左对齐 右对齐 中对齐 单元格 单元格 单元格 单元格 单元格 单元格 十一、代码1.语法： 代码之间分别用三个反引号包起来，且两边的反引号单独占一行。 123456789(```)public class Main { public static void main(String[] args) { System.out.println(\"Hello Word\"); }}(```)注：为防止转义给反引号加了括号。使用时请将反引号的左右括号去掉。 2.示例： 12345public class Main { public static void main(String[] args) { System.out.println(\"Hello Word\"); }} 十一、添加视频","link":"/2019/12/13/Markdown%E8%AF%AD%E6%B3%95/"},{"title":"人像摄影赏析","text":"在偏远山村有一对老夫妇，老爷爷早晨去上山砍柴，老婆婆去河边洗衣服，看到从河里飘来一个巨型大桃子，老婆婆废了好大的劲把桃子捞了起来，带回了家，和老爷爷一起用刀劈开了桃子，没想到出现个孩子，因为在桃子里出生老夫妻俩就给他起名为“桃太郎”。 后来岛上来了妖怪，专门欺负村民，桃太郎用糯米团子收容了小白狗、小猴子和雉鸡后去鬼岛斩杀了妖怪。 随便搞点图片，欣赏一下，活动活动眼睛。","link":"/2019/12/14/%E6%91%84%E5%BD%B1%E8%B5%8F%E6%9E%90/"},{"title":"泰国自由行游记_01：成都-普吉岛","text":"方式：落地签 自由行时间：2019年11月18-25日 共8天7晚行程：家–武汉–成都–普吉–芭提雅–曼谷–上海 这是我的第一次出国旅行。在语言不通，且出游经验为0的情况下，选择自由行无疑是在探险，同时也是挑战。哈哈，Just enjoy it。这是一段很特殊的经历，它开启了我人生中很多个第一次：第一次坐飞机、第一次出国、第一次潜水、第一次实弹射击……对于一个初当老外的人来说，一切都很新鲜，一切都很有趣，很多都是全新的体验。一路异国风情，一路美好时光，在这段日子里，不用想上班，不用想账单，不用管邮件，来呀，快活呀，反正有大把时间。 诗和远方固然美好，但终究还是要回归苟且。美好的时光总是短暂的，当你不再拥有时,唯一可以做的,就是不要忘记。谨以斯文以记之…… 前期准备定行程，做攻略订机票，买接机服务订酒店，关注附近的吃喝玩购落地签，准备相关材料换外币，汇率一算，身价过万电话卡，淘宝买的Happy卡爱屁屁，下载国外经常用到的App 18日 家-武汉-成都-普吉（误机、火锅）18日早上从家里出发，坐火车到武汉汉口，由于火车晚点，即使争分夺秒打车赶往机场，误机已是事实，直接导致武汉–曼谷（中转）–普吉的两张机票作废，泣。 重新规划的行程是：武汉–成都（中转）–普吉。 到了成都，离转机时间还早，就打算去成都市区转一转。么吃火锅，你也算来成都！？跟本地群友打听到有家谭鸭血火锅还不错，便直奔少陵路一番饕餮。吃完感受就是又麻又辣又烫，红红火火，恍恍惚惚。 从火锅店出来，沿少陵路稍许逛了会，路边很多美食。除买了点小米糕和小笼包作为夜宵之外，其余种种尽管馋而未临幸也。考虑到到了那边可能会水土不服，饮食不习惯，便去药店买了瓶泻立停以防不测，然后直奔机场飞普吉去也。 带了瓶椰奶准备在候机的时候喝，但在安检的时候不让带，如《人在囧途》中的王宝强一般无奈，之后在安检机前吨吨吨……全喝了。 19日 普吉（卡伦沙滩、浮潜）凌晨1点多飞机在普吉机场落地，然后就是办签证、过海关、换电话卡。在出口候车时，穿着冬装一秒入夏。酒店在卡伦沙滩附近，路上花了一个多小时，到房间时已是凌晨三点。 醒来已是9点，阳台外阳光充沛，视野很好。酒店在半山腰上，山上都是茂盛的热带植物，远处的海滩上已经有人在游泳潜水晒太阳了，一派南国夏日风情，很是养眼。 到位于山顶的餐厅去吃早餐，路边有些香蕉、菠萝蜜及其他不知明的热带树木。 早饭后下到海边，由于没带泳衣只能干溜达。溜达到中午在路边寻一家餐馆，点了椰子啤酒和当地美食，填了填肚子。在结账的时候本着锻炼锻炼口语的心态跟老板看看价，在一番中文、英文、泰文、手势、翻译APP、计算器的帮助下，一分也没砍掉，囧。 回去的路上碰到一对乐观开朗的老夫妻，感觉老爷爷有点像龟仙人，搭讪寒暄了一会，然后互相帮忙拍了照片。 回酒店换了泳装，顶着烈日便下海游泳去了。海水很漂亮，水下清澈透亮视野很好，可以睁眼，但是很模糊。后来买了浮潜面罩，终于能看清海底了，还看到了很多热带鱼，还在海底捡到个鱼形铅坠，后来放在沙滩上，走的时候忘记拿了。 整个下午都泡在水里，游泳、看鱼、吐泡泡、躲在水里避雨、看彩虹、看夕阳，拍照，随着海浪起起伏伏，很是好玩。由于一个人漂的太远，面罩呛水导致差点溺水，幸好及时调整状态，冷静处理，最终化险为夷。真是一次前所未有新奇体验，好玩也好险。 早餐在餐厅认识几个国内的朋友，本来约好晚饭去芭东海滩的班赞海鲜市场吃海鲜大餐的，由于下雨只好作罢，成为未却之遗憾。 20日 普吉（珊瑚岛、皇帝岛）今天的日程是皇帝岛一日游，在飞猪上买的，包接送。 早上在餐厅帮一对国内的老夫妻，调解他们与老板娘之间的误会。奈何英语太菜，搜肠刮肚外加翻译app勉强搞定，看来学习英语真的要提上日程了。 按计划，在普吉镇码头，坐上棉花糖号帆船，然后出海。先去珊瑚岛，在岛上午餐后歇脚后，然后出发去皇帝岛。 船停在皇帝岛港口外，水深大概在10米左右，传说救生衣就下去了。也能看到很多小鱼，大多集中在船底，靠近岸边还有海胆什么的。由于天阴水下视野较暗，再加上昨天呛水的事情心有余悸，浮潜便草草结束。 之后又坐着充气艇去到岛上，然后在那边的白色沙滩下，游了一个多小时。 3点半回到棉花糖，返航途中分发渔具，开始钓鱼，此时的水还是很深的，大概有30多米。钓了半天只有两个同伴钓上来了，其余只好悻悻收线，无功而返。 然后就是看日落，看海豚，吃刺身，听前奏猜歌赢椰子游戏，分发寿司、香槟。回到码头，双条车摆渡，回家。","link":"/2019/12/20/%E6%B3%B0%E5%9B%BD%E8%87%AA%E7%94%B1%E8%A1%8C%E6%B8%B8%E8%AE%B01/"},{"title":"泰国自由行游记_02：普吉岛-芭提雅","text":"hahah 21日 普吉-芭提雅（街边小吃、特产商店、人妖、热带水果）今天的日程是从普吉坐飞机去乌塔堡机场，然后坐大巴去芭提雅。在去机场的路上，饱览异国风情和热带风景，药店，马杀鸡店，酒吧，711，佛塔，普通人家，还有大象，橡胶树，棕榈树。 在泰国的这段时间，在我的散装英语不起作用的情况下，谷歌翻译App可是帮了大忙。跟出租车司机畅快的交流，【图】跟司机交流【图】 从普吉机场到乌塔堡机场大概一个多小时，然后坐大巴到芭提雅市区酒店，大概又走了一个多小时。在路上看到一个浴室的广告，感觉里边在搞黄色，但是我又没有证据，因为我看不懂这些英语，哈哈。 到了酒店已是傍晚，去楼顶看了下网红无边泳池，拍了拍芭提雅市区俯瞰图，然后在路边摊解决一下温饱。在当地的一个特产商店逛到天黑，在711买点日用品。 来芭提雅主要是为了射击，对看人妖不感兴趣，也不在计划之列。但中国有句老话：来都来了，然后有然后了，哈哈……看的是六九成人秀，大尺度，毁三观，看能回国能吹一年。不虚此行，值回票价了。临走在在门口拍了两张人妖的照片。 在门口见有卖热带水果的，拿了一盒榴莲，一盒释迦果，也不便宜，甚至有点小贵。本想拦一辆双条车，一公里多的路要200株，算了，最后还是走回家的。路上居然看到了韵达快递的中文招牌，看来此地国人不少啊。 22日 芭提雅-曼谷（无边泳池、实弹射击、曼谷大排档）拿昨晚的水果和牛奶凑合了顿早饭。吃完换上泳衣去楼顶的无边泳池浪，水是真凉，热身了半天下去还是凉飕飕的。为了在这难得的网红无边泳池凹造型拍照，咬咬牙忍了。中途认识一个来自天津的朋友，互相询问了行程之后，推荐去射击场，互相帮忙拍了照片，收拾好下去一起吃饭，二逛那个特产超市。 从酒店到郊区的射击场大概半个多小时，我选的是双人A套餐，10发步枪弹，10发手枪弹，10发左轮手枪弹。步枪子弹较细，射击时声响不大，手枪声音最大，抖动也最大，左轮最舒服。射击的结果如图 射击完后收拾行李去到酒店旁边的芭提雅汽车站，中途一队校车大巴路过，孩子们热情的挥手，你好，再见。 去曼谷2个多小时的车程，由于遇到了傍晚曼谷的下班高峰，堵到车站用时3个多小时。在路上的找个大排档，跟朋友一起吃了个饭，然后送他去机场。下了BTS，酒店附近有个夜市，一个一个椰子，喝完之后，吃椰肉，心满意足的回酒店。","link":"/2019/12/21/%E6%B3%B0%E5%9B%BD%E8%87%AA%E7%94%B1%E8%A1%8C%E6%B8%B8%E8%AE%B02/"},{"title":"泰国自由行游记_03：曼谷-上海","text":"hhahah 23日 曼谷（乍都乍周末市场、湄南河、大皇宫、拉差达火车夜市）在楼下的小吃摊吃罢早饭，搭乘BTS去久负盛名的乍都乍周末市场，市场很多，商品种类繁多，关键是便宜，可以淘到很多好用还好玩的宝。 中途在逛一个艺术区的时候，看着一幅幅抽象的让人头大的艺术品时，突然有了感悟：艺术的东西为什么让人看不懂？因为纯写实的东西在生活中太常见太乏味了，再蹩脚的照相师拍出来的照片也比最伟大的艺术家画的逼真，但艺术来源于生活又高于生活，艺术是给人以无限想象的，无穷回味的，可以滋养人的心理和思想。 中午出市场找个块绿地坐下吃点东西，旁边不断走过放学的学生，他们校服款式各异，应该是不同学校的，但是都很好看，很自然的让人想到了《初恋那件小事》里的小水和学长。啊，青春真的很美好。 把在市场上买的东西放回酒店，出门了先奔湄南河，坐船游览沿岸风光，就像坐这独轮船游览外滩一样。等赶到大皇宫的时候，已经是他们闭馆的时间，只好在门口拍了照片准备返程，在路上碰上一个热情的泰国小哥，中文说的还行，中泰英混杂的聊了一会。推荐我们去郑王庙，水上市场。由于没找到合适的游船，只好作罢。 下一站，去拉差达火车夜市，那里就像中国的夜市，身边都是国人，吃了网红火山排骨，在附近停车场找到网红的拍照机位。吃完喝完，照片拍完，回家。 每次回去都不忘在这个摊位，买个冰椰子，喝完椰汁再让老板剜出椰肉，喝完吃完，才心满意足的回去休息。 24日 曼谷（王权免税店、马杀鸡、暹罗海底世界）针对外国游客的King Power免税店由于免税，东西品正又便宜，成为很多人的心头爱。进了王权怎能不买买买。女人们多集中在口红香水，护肤化妆品柜台，我则在数码和药品区消磨了大半天时光。 从King Power出来已是傍晚，逛了一天腰酸背痛，体验了一下当地的特色马杀鸡。完事之后满血复活元气满满，打了辆突突车去暹罗中心看海洋世界，等到了地方为时已晚，已经不让进了。在商场随便转了转，吃了点东西，归。 回来照旧在那个椰子摊，吃完喝完，休息。 25日 曼谷-上海（返程）早上收拾完行李，乘BTS从胜利纪念碑站–帕亚泰站(转机场线)–素万那普机场。接下来的流程：取票值机、称重托运、安检、通关、退税、王权机场店取货、候机、午饭、登机。在称重托运的过程中，由于行李超重10kg，额外花了￥365托运费，泣。 返程坐的是素万那普–浦东的航班，由于坐的位置位于翅膀，机位不好，夕阳照片没拍到。中途有空少推销免税香烟，比地上便宜不少，拿了两条。 18：30飞机落地，此时我还是短袖短裤，一副南国夏日的装扮。踏出舱门，外面呼啸的冷风告诉我：醒一醒小伙汁，你此次泰国之旅结束，该回归现实了，你的世界从此由夏入冬了。 小插曲 & 经验教训至少提前一个小时到机场，免得误机。行李可以带上飞机，但不得带超过100ml液体，充电宝要拿出来。落地签提前准备好材料，免得到时语言不通手忙脚乱被人催。玩水千万要注意安全，最好结伴。做好防晒，做好防晒，做好防晒。返程机票记得买行李额，买了那么多东西，行李肯定超重。","link":"/2019/12/22/%E6%B3%B0%E5%9B%BD%E8%87%AA%E7%94%B1%E8%A1%8C%E6%B8%B8%E8%AE%B03/"},{"title":"《用理工科思维理解世界》读书笔记","text":"用一万小时培养天才·用心理学反成功学·用大数据预测未来·用实验刺探真相…… 让大脑翻墙，跳出隐藏在常识中的思维陷阱 大量你经常接触的知识，挑战你万万没想到的认知神经。 反不靠谱的常识性的思维惯性，反听着无害但喝起来有毒的心灵鸡汤，反成功学； 要用“科研的格调”来理解和认识世界，需要有靠谱的判断力。 第一章：反常识思维 123456789\"反常识\"思维别想说服我！真理追求者坏比好重要最简单概率论的五个智慧一颗阴谋论的心桥段会毁了你的生活健康的经济学核电站能出什么大事 他们有时候把自己的价值判断称为「常识」，因为这些判断本来就是从人的原始思维而来的，然而现代社会产生了另一种思维，却是「反常识」的。 在这一章节中，作者指出了若干看似「正常」的社会现象背后所隐藏的心理学原理。现代社会生活中，人们主动或被动接收大量的信息，并且做出相应的判断，长时间下来逐渐形成一套固有的价值判断标准。然而当我们面对一个事件，这种自有价值判断标准会有失灵的时候，旧的判断法则就会无法得出真实的结果。 确认偏误（confirmation bias）是人们根据一定表现的现象开始做出了自己认为正确的判断，就会主动去寻找能够证明这个判断是正确的信息。人们需要的东西，比如娱乐和确认，电视节目或者网络上不靠谱的新闻就可以提供。人们需要你的提供的信息能够用轻松愉快的方式确认他们已有认为正确的观点：比如「对的！人贩子就应该枪毙！」，「辐射对身体有害，所以信号发射塔决不能立在我家旁边！」、「某国外一研究者证明睡懒觉可减少心脏病的发生几率」，「成功人士的10个特征，你具备了几条？」。另外一方面即继续坚持错误的东西，即使在一开始他就认为自己会失败。科学进步在于不断纠错，虽然承认自己的错误在面子上或许有点过不去。这些信息提供者为了迎合受众不择手段，他们的唯一目的是赚盲从者的钱，因为他们的钱最好赚，还不用背负骗子的骂名。 损失厌恶，人们偏好获得而厌恶失去的感觉。国外有一个人做过一个实验，实验人员给受试者50美元，受试者有两个选择：选择赌一把，但是只有40%的概率可以把50元拿走，60%的机会一分钱都拿不到；选择不赌，直接拿其中的20元走人。实验结果是大多数人选择直接拿20元走人，只有42%的人选择冒险。人们对负面情绪的重视程度总是超过正面感情，心理学上称之为负面偏见（negativity bias），也就是坏的比好的重要。也许你经常帮一个同学的忙，一旦又一次你没有帮他，他就会很生气，以至于很多年以后他忘记了以前你帮过的忙而只记得你曾经拒绝帮他；在社交网络上发布一条状态，喜欢的人最多可能点一个赞或者评论个表情就算不错了，事实上，大多数情况下是什么也不做，而不喜欢的人却往往要把自己的意见大肆发表一番。 阴谋论的心，人们偏爱阴谋是因为生活中发生的许多事件自己无法立刻解释，快速而没有太大成本的判断在大脑中大有其生长的沃土，「是的！是的！一定是这样的！」。规律经常能够得到更多青睐，大概是因为不需要人动多少脑子。所谓预言藏头诗、推背图和烧饼歌不过是随机事件的组合而已。很多事情的发生是相互独立的，背后不太可能存在别有用心的目的，阴谋论认为的合理性并不能成为可能性存在的理由。不管是1997年亚洲金融危机归罪于索罗斯，还是近来怀疑股市大跌背后存在的恶意做空势力，都存在阴谋论的影子。 小结按道理说，新闻的作用是传递信息和正确的价值观，但事实往往是前者效率极低，后者效果不明显。时刻关注「东方之星」游轮沉没铺天盖地的报道远比仔细阅读一篇事后调查报告的效率要低；为吸引点击率，标题党、恶意谣言编造者和歪曲事实者屡见不鲜，通过看新闻来提高批判性思维的能力简直就是异想天开。带有目的性的主动收集是获取信息最有效的方式，在电脑或在手机上阅读，阅读者成为信息提供者的奴隶，被动点开一个一个又一个的超链接。看新闻跟看电影、刷微博本质上同属娱乐方式，漫无目的的点击只会使人丧失辨别的能力。 第二章：成功学的解药 1234567891011121314科学的励志和励志的科学匹夫怎样逆袭练习一万小时成天才？最高级的想象力是不自由的思维密集度与牛人的反击上网能避免浅薄吗？高效\"冲浪\"的办法笔记本就是力量用强力研读书创新是落后者的特权：三个竞争故事过度自信是创业者的通行证夺魁者本色打游戏的三个境界穷人和富人的人脉结构 有一项研究，它对大学生的三十多项品质进行了统计，发现其中绝大多数对学习成绩没有影响，真正能够左右成绩的品质只有一个：自控。自控需要意志力，意志力是一种有限的资源，而专心于一件事会消耗意志力，会产生累的感觉。为什么当期末考试临近之前学生们更容易早睡，不去参加剧烈活动？因为他们的意志力用在了学习上了，如果根本不在乎考试成绩的学生另当别论。意志力跟肌肉一样，经过训练之后，韧度会有明显提升；自我和外在监督也可以有效地提升意志力。我们有必要建立一个属于自己的意志力「信用银行」，平时不断训练以提高「信用额度」（之前我有一篇关于如何提高自控力读书笔记）。 「不要输在起跑线」已经成为了带有贬义的口号，事实上，人们同时又说人生是一次长跑，输了这一次还有下一次的安慰的话。既然人生是一次长跑，如果在起点就已经落后别人许多了，那么想通过遵循领先者制定的规则实现反超的做法就有点不靠谱了。在NBA比赛中，你经常会发现这样的情况，在最后一节，落后的一方由于实力差距或者客场作战的因素，通过常规的手段已经无法获胜。有的教练就会布置「砍人战术」，即安排队员盯住对方罚球最不好的一名队员并对他犯规，对方在底线刚刚发出球就马上犯规，这样一来罚球的球员也罚不进，对方的进攻节奏也被打乱了。虽然这样打出来的比赛，就观赏的角度可能有点不好看，但循规蹈矩获胜的概率微乎其微。落后者想要逆袭，必须知己知彼。维护现有的秩序和规则是精英阶层的任务，而改变、创造规则，不按常理出牌则是落后者的特权。 不知道你有没有听说过「一万小时定律」，这个说法来自商业畅销书作家马尔科姆·格拉德威尔（考研英语一有一篇反驳他的作品「引爆点Tipping Point」的阅读文章），即天才不是天生的，是练出来的，而且要练习一万个小时。那么就是不是意味着只要每个人每天练习3小时，10年之后我就可以达到世界级水平呢？答案显然是否定的。就拿每年6月7号和6月8号参加全国高考的那一批人来说，他们的练习时间远远不止一万小时吧？先不论时间的长短，为什么有的考生可以考上清北复交，绝大多数考生比如像我，拼了命就算再花几年也上不了那些顶尖名校。其实真正的关键根本不是训练时间的长短，而是训练的方法，强调练习的同时否定天赋的重要性也是很不负责任的。 现在的人差不多每个人都是时代的宠儿，谈论吃苦已经没有太多的意义，甚至苦难有的时候是没有价值的。练习或者工作带来的疲劳与充实感并不能使你成为领域内顶尖高手的可能性变大，想要达到顶尖水平就必须使用科学的训练手段来提高自己，幸好有互联网，即使是经济条件不充裕的人也有机会学习世界顶尖大学的课程。如何练习，佛罗里达大学心理学家安德斯·埃里克森提出了刻意练习（deliberate practice）的概念，总结下来有四点： 只在「学习区」练习；把要训练的内容分成有针对性的小块，对每一个小块进行重复训练；在整个练习的过程中，随时能获得有效的反馈；练习时注意力必须高度集中。 心理学家把人的知识和技能分为三个圆形区域：最内一层是「舒适区」，是我们已经熟练掌握的各种技能；最外一层是「恐慌区」，是我们暂时无法学会的技能，二者的中间则是「学习区」。在舒适区做事，叫生活；在学习区做事，才叫练习。刻意练习的精髓是持续不断地做自己做不好的事情。在学习区不是一件轻松的事，在实际生活中，人们的主要精力都被放在了自己驾轻就熟的事情上，简单机械地重复舒适区的事情不会使你有多大的进步，顶多你会成为一个熟练的操作者。刻意练习需要思考、沉浸和专注，不断达到新的目标。 那么训练的诀窍在哪里呢？关键在于两点：必须进行大量的重复训练；训练必须有高度的针对性。 用两个词语来总结就是：专注、重复。即使是世界顶级水平的运动员也要抽时间来抠基本技术，基本功就是这么重要。其次，训练必须有高度的针对性，否则就是浪费时间，给第二天的微积分考试复习线性代数帮助会大吗？也就是，有针对性地练习基本技能，然后不断重复，重复，再重复。 去年我在某问答网站看过@培训师徐强写过的一篇专栏，与本书作者的观点一致，他们的文章解释了为什么我们打游戏的时候可以连续几个小时不熄火而一碰到一本厚厚的专业书就眼皮打架。游戏设计为了持续刺激玩家的大脑分泌多巴胺，必须能够随时使玩家获得即时的反馈（immediate feedback）。我们在学完一门课程或者看完一本书之后，像玩游戏带来实质性的反馈结果——装备升级、获得金钱和半个小时后宣告胜利或者失败——并不能马上显现，学习者对于正确或者错误的敏感度也不高，故学习的热度坚持不了很久。高效率、持续时间长的方法是在树立一个清晰明确的目标的前提下，在安静的环境单独专心学习，期间进行即时的错误纠正获得反馈，比如做完一套试卷马上对答案，纠正错误。刻意的练习往往不好玩，寓教于乐并不现实，波兹曼在「娱乐至死」一书中写道： 「教育哲学家认为获得知识是一件困难的事情，认为其中必然有各种约束的介入。他们认为学习是要付出代价的，耐力和汗水不可少，个人的兴趣要让位于集体的利益。想要获得出色的思辨能力对年轻人来说绝非易事，它是异常艰苦卓绝的斗争。西塞罗说过，教育的目的本来应该是摆脱现实的奴役，而现在的年轻人正竭力做着相反的努力——为了适应现实而改变自己。」 那么为什么有人愿意下这么大的一个赌注去练习一万个小时？用作者的一句话就是：「世界并不需要一千个钢琴大师或者一万个足球明星，这些少数的幸运儿已经把所有位置都占满了。如果你想享受快乐童年，你的位置在观众席。」 假设我愿意为自己的未来豪赌，那么首先要考虑的是我总该玩一个自己喜欢的赌法吧。德国的一项研究做了关于学习动力和学习方法的调查，主要项目包括内在动力（学习兴趣）、外在动力（压力）和学习方法，研究发现内在动力和学习方法是提高学习成绩最主要最长久的因素。学习方法之前已经介绍过来，那么问题来了，如何找到自己的真正兴趣呢？在这里科学界研究了几十年，得出一个共识是，先天因素远远大于后天因素。也就是我们的基因决定了我们的喜好，喜好决定我们追求什么，你是否能够死心塌地地在某个方向刻意练习基本上是天生的。（多么痛的领悟==） 有的人足够幸运在早些时候就听到了自己内心的声音并勇敢坚持下去，这些人便是天才；而有的人终其一生也没找到，这些人就是普普通通的大众如你我。但是也不要气馁，探索自己的兴趣，积极认识自己，发现自己，这难道不就是人生的全部意义吗？ 读书的目的是获得见识和提高学习水平最有效方法，读书可以帮助你强化批判性思维，发现问题本质的能力。书籍浩如烟海，一个人不可能在其有生之年读完所有的书，不可能也没有必要。「如何阅读一本书」总结了关于读书的技术，并认为读书有三个层次：为了娱乐而读，为了信息而读和为了理解而读。只有为了理解我们原来不懂的东西才值得认真对待；读书应该把握主动性，别被作者牵着鼻子走。如何高效率读书？作者提倡一种高强度的读书方法——强力研读，一种深度高效的阅读方法，其核心技术是读书笔记。 读书并不轻松，是一门技术，会读和爱读是两码事。一本书在它被读完一遍之后它的使命并不就此打住，合上书本，静下来想想作者到底说了些什么玩意儿，能不能用自己的语言简洁地概括或者讲给别人听。一本书要读两遍，而且要读得慢，在第二遍的时候读书笔记就派上用场了。作者认为好的读书笔记应该是： 清晰地表现每一章的逻辑脉络；带走书中所有的亮点；有大量自己的看法和心得；发现这本书和以前读过的其他书或文章的联系。有人认为「功夫在诗外」，看完之后有一种全都懂了的错觉，一本书读完了之后既不做总结也不理清作者的思路。其实，阅读是一次与作者对话的过程，阅读的时候最好右手一支笔，随时在书的空白处用简练的语言总结作者的想法或者自己的观点。在拿到书的时候第一步就是看看书的目录，作者是否逻辑严谨从目录就可以看出来，然后看看序言和后记，经过了这两个步骤大致就明白作者在讲些什么了。第一遍阅读速度可以稍微快一点，不懂的地方先跳过去，因为读到后面或者到第二遍阅读的时候你会发现理解起来更加容易。第二遍阅读伴随着记读书笔记，这个过程决定你对书中内容的掌握程度。 就我而言，现阶段能够做到的暂时只有1和4，但我认为在不管是阅读材料质量和阅读量都落后的情况下，循规蹈矩虽然稳定，但时间不允许，前期以量取胜不失为上策，创造适合自己的规则是落后者的特权。最后一定要有反馈，把你的成果分享给大家（事实上，没有人会去关心你写了什么鬼），外在监督远比自我监督有效，如果你不想让朋友认为你没有恒心的话。朋友的鼓励和成就感会支撑你继续强力研读下去！长此以往，相信逐渐积累的笔记本最终将成为你知识图书馆的一砖一瓦。 小结鸡汤、成功学为什么处在鄙视链的最低端，因为他们善于炸香喷喷的油饼，却给不了你一双筷子。励志需要数据分析在背后作为支撑才可以成为科学的励志。 第三章：霍金的答案 12345678910亚里士多德为何不数数妻子有几颗牙物理学的逻辑和霍金的答案怎样用统计实验检验灵魂转世假说一个关于转世的流行病学研究摆脱童稚状态怎样才算主流科学？科研的格调喝一口的心理学与喝一瓶的心理学医学研究能当真吗？真空农场中的球形鸡 对待自己还是面对世界，都需要理性的态度，理性的态度可以帮助人们了解自己和世界。本章讨论的是何为科学精神，科学理论确立的顺序是事实→证据→规律，魏格纳为了大陆漂移假说，收集了许多生物化石证据，在普通人看来这么多证据，大陆漂移肯定是事实了。但是科学家们想不通大陆为什么会漂移，推动大陆漂移的巨大能量来自哪里无法解释，一直到后来地质板块边缘火山喷发和地震可以提供能量，并且发现不同时期火山喷发的证据。再加上其他的一些证据，假说才变成了理论，可是魏格纳早已经不在人世了。 同样的还有霍金和他宣称已经几乎成型的「大一统理论」就有很多人不买账，原因是在他的新书「大设计（The Grand Design）」中许多的论证仍然不够严谨。完美的物理学理论能够解释现在和预言未来，「大一统理论」完善了，它便会成为人类通往未来的钥匙。还有关于地外文明的争议，地外文明应该是存在的，只是每一个宇宙都有其适应自身的一套物理规律，他们的规律跟我们所处的宇宙不同，但它能很好地解释在该环境下的各种现象和预言未来。 检验一个结论是否正确，最好的办法就是设计一个实验去验证。比如灵魂是否真正存在、辐射对人体的损害程度、网瘾与青少年犯罪率是否正相关等等问题，如果试着从道德、历史或者哲学什么方面去得出正确的结论那就有点不实际了。设计良好的实验相当重要，对于有些问题却不好做实验，比如研究吸烟对人体的危害，你就不能强迫受试者吸烟。这种情况下，通过纯粹的被动调查来做研究的方法叫做流行病学（epidemiology），也就是很早就开始准备，然后一直跟踪调查，得出的结果比较有说服力，但耗时较长。 小结完美的理论不仅可以解释现在而且可以预言未来。科学的思维对人大有裨益，尽管你可能不会去从事科研活动，但至少可以帮助你不会轻易去相信别人的言论，从而少上当受骗。","link":"/2019/12/10/%E7%94%A8%E7%90%86%E5%B7%A5%E7%A7%91%E6%80%9D%E7%BB%B4%E8%AE%A4%E8%AF%86%E4%B8%96%E7%95%8C%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"Markdown","slug":"Markdown","link":"/tags/Markdown/"},{"name":"人像","slug":"人像","link":"/tags/%E4%BA%BA%E5%83%8F/"},{"name":"摄影","slug":"摄影","link":"/tags/%E6%91%84%E5%BD%B1/"},{"name":"表情包","slug":"表情包","link":"/tags/%E8%A1%A8%E6%83%85%E5%8C%85/"},{"name":"旅行","slug":"旅行","link":"/tags/%E6%97%85%E8%A1%8C/"},{"name":"读书","slug":"读书","link":"/tags/%E8%AF%BB%E4%B9%A6/"},{"name":"方法论","slug":"方法论","link":"/tags/%E6%96%B9%E6%B3%95%E8%AE%BA/"}],"categories":[{"name":"学习/编程","slug":"学习-编程","link":"/categories/%E5%AD%A6%E4%B9%A0-%E7%BC%96%E7%A8%8B/"},{"name":"摄影/摄像","slug":"摄影-摄像","link":"/categories/%E6%91%84%E5%BD%B1-%E6%91%84%E5%83%8F/"},{"name":"生活/旅行","slug":"生活-旅行","link":"/categories/%E7%94%9F%E6%B4%BB-%E6%97%85%E8%A1%8C/"},{"name":"读书/写作","slug":"读书-写作","link":"/categories/%E8%AF%BB%E4%B9%A6-%E5%86%99%E4%BD%9C/"}]}